const songsData = [
    {
        id: "viski-s-molokom",
        title: "виски с молоком",
        artist: "снялцепи",
        album: "виски с молоком",
        releaseDate: "2025",
        addedDate: "2026-03-23",
		textAuthor: "Reloster",
		explicit: true,
        cover: "../1.png",
        src: "../1.mp3",
        lyrics: [
			{ time: 0.0, text: "(музыка)" },
            { time: 1.4, text: "я лью пиздатый виски", kidsText: "я лью ******** виски" },
            { time: 3.1, text: "с белым молокооом!" },
            { time: 5.6, text: "она не знает меня" },
            { time: 7.3, text: "что было потом (она не знает)" },
            { time: 9.7, text: "ей нужен большой дядя" },
            { time: 11.2, text: "с большим кошелькооом!" },
            { time: 13.7, text: "таблетки дали о се знать", kidsText: "******** дали о се знать" },
            { time: 15.8, text: "только в одном (только в одном)" },
            { time: 17.8, text: "и я тупой" },
            { time: 18.9, text: "она думает я гандон", kidsText: "она думает я ******" },
            { time: 21.9, text: "мол, потому-что я пью виски с молоком" },
            { time: 26.0, text: "весь преппарат в тебе", kidsText: "весь ********* в тебе" },
            { time: 27.5, text: "и ты лежишь под мостом" },
            { time: 30.0, text: "прости, малыш, я не хотел быть слабаком" },
            { time: 33.1, text: "щас модно говорить типа пьяный", kidsText: "щас модно говорить типа ******" },
            { time: 35.2, text: "бездельник, мои руки в карманы" },
            { time: 37.5, text: "слезы лечат только заны", kidsText: "слезы лечат только ****" },
            { time: 39.0, text: "смотри на мя, залижи мои раныы", kidsText: "смотри на мя, ****** мои *****" },
            { time: 41.3, text: "щас модно говорить типа пьяный", kidsText: "щас модно говорить типа ******" },
            { time: 43.5, text: "бездельник, мои руки в карманы" },
            { time: 45.7, text: "слезы лечат только заны", kidsText: "слезы лечат только ****" },
            { time: 47.1, text: "смотри на мя, залижи мои раныы", kidsText: "смотри на мя, ****** мои *****" },
            { time: 55.6, text: "смотри на мя, залижи мои раныы!", kidsText: "смотри на мя, ****** мои *****" }
        ]
    },
    {
        id: "romashka",
        title: "пісня про ромашку",
        artist: "хейтспіч",
        album: "EP",
        releaseDate: "2022",
        addedDate: "2026-03-24",
		textAuthor: "None",
		explicit: true,
        cover: "../2.png",
        src: "../2.mp3",
        lyrics: false
    },
    {
        id: "dark-prince",
        title: "свалка",
        artist: "темный принц",
        album: "мрачные тренды",
        releaseDate: "2025",
        addedDate: "2026-03-25",
		textAuthor: "Reloster",
		explicit: false,
        cover: "../3.png",
        src: "../3.mp3",
        lyrics: [
            { time: 0, text: "(музыка)" },
            { time: 5.3, text: "громкий стук об твою дверь" },
            { time: 8.1, text: "и я ломаю руки в кровь" },
            { time: 11.6, text: "утром снова в ателье" },
            { time: 14.2, text: "мне сшили новое лицо" },
            { time: 17.7, text: "смотрю на то как ты спишь" },
            { time: 20.5, text: "и видишь самый сладкий сон" },
            { time: 23.7, text: "просто оставь меня на мусорной свалке" },
            { time: 28.9, text: "мне место среди" },
            { time: 32.4, text: "битых машиин" },
            { time: 34.7, text: "и, мертвых петель" },
            { time: 40.2, text: "вы-бро-шен-ный" },
            { time: 43.2, text: "(музыка)" },
            { time: 50.1, text: "громкий стук об твою дверь" },
            { time: 53.0, text: "и я ломаю руки в кровь" },
            { time: 56.4, text: "утром снова в ателье" },
            { time: 59.1, text: "мне сшили новое лицо" },
            { time: 62.5, text: "смотрю на то как ты спишь" },
            { time: 65.3, text: "и видишь самый сладкий сон" },
            { time: 68.6, text: "а я спресованный в коробку" },
            { time: 71.6, text: "буду вспоминать лицо..." }
        ]
    },
	{
		id: "raspyat",
		title: "распять",
		artist: "greyrock, tewiq, madk1d",
		album: "распять",
		releaseDate: "2025",
        addedDate: "2026-03-25",
		textAuthor: "Reloster",
		explicit: true,
        cover: "../4.png",
        src: "../4.mp3",
		lyrics: [
			{ time: 0.6, text: "ладони полны слёзок" },
            { time: 2.5, text: "но время не вернуть вспять" },
            { time: 5.0, text: "на деревянный крест" },
            { time: 6.4, text: "можешь распять меня раз пять", kidsText: "можешь ******* мня раз пять" },
            { time: 9.0, text: "я снова своровал твои мысли их не понять" },
            { time: 13.2, text: "отомсти мне за все" },
            { time: 14.8, text: "обиды запиши в тетрадь" },
            { time: 17.3, text: "ладони полны крови будто терся об ножи", kidsText: "ладони полны ***** будто терся об ****" },
            { time: 21.5, text: "на деревянный крест можешь распять", kidsText: "на деревянный крест можешь *******" },
            { time: 24.0, text: "пока я жив" },
            { time: 25.6, text: "я снова своровал твое сердце будто каджит" },
			{ time: 29.7, text: "отомсти мне за все" },
			{ time: 31.3, text: "обиды запиши в дневник" },
            { time: 33.8, text: "как ты попала в мои строки" },
            { time: 36.5, text: "в тиктоке огни" },
            { time: 38.0, text: "ты знаешь, о ком все строки" },
            { time: 40.3, text: "этот город один" },
            { time: 42.1, text: "и мы в нем все одиноки" },
            { time: 44.5, text: "давай возьмем грибы" },
            { time: 46.2, text: "из магазина эноки" },
            { time: 48.3, text: "ты знаешь, во мне петарды", kidsText: "ты знаешь, во мне *******" },
            { time: 50.3, text: "ты знаешь, что во мне бомбы", kidsText: "ты знаешь, что во мне *****" },
            { time: 52.7, text: "я хотел бы увидеться" },
			{ time: 54.7, text: "к счастью, связаны руки" },
			{ time: 56.5, text: "ты знаешь этот майндсет" },
			{ time: 58.7, text: "ты знаешь все эти звуки" },
			{ time: 60.7, text: "ты знаешь почему больно" },
			{ time: 62.7, text: "меня заполонил холод" },
			{ time: 64.8, text: "в моих руках твое тело" },
			{ time: 66.8, text: "а значит ладони полны" },
			{ time: 69.4, text: "ладони полны слёзок" },
            { time: 71.3, text: "но время не вернуть вспять" },
            { time: 73.6, text: "на деревянный крест" },
            { time: 75.2, text: "можешь распять меня раз пять", kidsText: "можешь *******" },
            { time: 77.7, text: "я снова своровал твои мысли их не понять" },
            { time: 81.8, text: "отомсти мне за все" },
            { time: 83.6, text: "обиды запиши в тетрадь" },
            { time: 86.1, text: "ладони полны крови будто терся об ножи", kidsText: "ладони полны ***** будто терся об ****" },
            { time: 90.2, text: "на деревянный крест можешь распять", kidsText: "на деревянный крест можешь *******" },
            { time: 92.8, text: "пока я жив" },
            { time: 94.3, text: "я снова своровал твое сердце будто каджит" },
			{ time: 98.4, text: "отомсти мне за все" },
			{ time: 101.1, text: "обиды запиши в дневник" }
		]
	},
	{ 
		id: "sadsvitnebo",
		title: "Небо",
		artist: "SadSvit",
		album: "Небо",
		releaseDate: "2022",
        addedDate: "2026-03-24",
		textAuthor: "Reloster",
		explicit: false,
        cover: "../5.png",
        src: "../5.mp3",
        lyrics: false
    },
	{ 
		id: "dirkivshtanah",
		title: "дырки в штанах",
		artist: "madk1d",
		album: "дырки в штанах",
		releaseDate: "2025",
        addedDate: "2026-03-26",
		textAuthor: "Reloster, pasters",
		explicit: true,
        cover: "../6.png",
        src: "../6.mp3",
        lyrics: [
			{ time: 0.3, text: "я тебя люблю" },
            { time: 1.5, text: "скажи мне да или нет" },
            { time: 3.1, text: "зомби в моей комнате" },
            { time: 4.6, text: "не выключает свет" },
            { time: 6.1, text: "сколько времени прошло" },
            { time: 7.7, text: "или сколько лет" },
            { time: 9.0, text: "(ха-ха, че поверили, бля?)", kidsText: "(ха-ха, че поверили ***?)" },
            { time: 11.4, text: "она знает почему у меня дырки в штанах" },
            { time: 14.1, text: "она попалась на 'сосала?'", kidsText: "она попалась на '******?'" },
            { time: 15.9, text: "и ответила да!" },
            { time: 17.1, text: "я так люблю тебя, поверь" },
            { time: 18.5, text: "но между нами хуйня", kidsText: "но между нами *****" },
            { time: 20.3, text: "и я хз почему, но уже боюсь без тебя" },
            { time: 23.2, text: "она знает почему у меня дырки в штанах" },
            { time: 26.0, text: "она попалась на 'сосала?'", kidsText: "она попалась на '******?'" },
            { time: 27.7, text: "и ответила да!" },
            { time: 29.0, text: "я так люблю тебя, поверь" },
            { time: 30.5, text: "но между нами хуйня", kidsText: "но между нами *****" },
            { time: 32.0, text: "и я хз почему, но уже боюсь без тебя" },
            { time: 35.1, text: "и я знаю то что раньше изменяла парням" },
            { time: 37.9, text: "твой топер дохуище выше", kidsText: "твой топер ******* выше" },
            { time: 39.5, text: "измеряла по дням" },
            { time: 40.8, text: "ты выглядишь так ахуительно", kidsText: "ты выглядишь так **********" },
            { time: 42.7, text: "примерно на лям" },
            { time: 43.8, text: "мой бро везет все это в жопе", kidsText: "мой бро везет все это в попе" },
            { time: 45.5, text: "если не могу сам" },
            { time: 47.0, text: "мне везёт, я с фортуной, бери деньги у мамы" },
            { time: 50.0, text: "мы писали альбомы" },  
            { time: 51.3, text: "да, бро, мы пишем романы" },
            { time: 53.0, text: "мы купили покурить", kidsText: "мы купили пок***ть" },
            { time: 54.2, text: "раньше тёрли руками" },
            { time: 55.8, text: "я могу дать в ебло", kidsText: "я могу дать в ****" },
            { time: 57.0, text: "но больнее будет словами" },
            { time: 59.0, text: "грустно стримит на потоке, практикует селфхарм", kidsText: "грустно стримит на потоке, практикует ********" },
			{ time: 61.6, text: "я знаю только два Бориса:" },
			{ time: 63.3, text: "есть REDWALL и Биджан" },
			{ time: 64.5, text: "зачем тебе контакты реперов? ты просто еблан", kidsText: "зачем тебе контакты реперов? ты просто *****" },
			{ time: 67.5, text: "сейчас есть тыща вариантов, тех кого поебал", kidsText: "сейчас есть тыща вариантов, тех кого ******" },
			{ time: 70.6, text: "она знает почему у меня дырки в штанах" },
            { time: 73.4, text: "она попалась на 'сосала?'", kidsText: "она попалась на '******?'" },
            { time: 75.2, text: "и ответила да!" },
            { time: 76.4, text: "я так люблю тебя, поверь" },
            { time: 77.9, text: "но между нами хуйня", kidsText: "но между нами хуйня" },
            { time: 79.4, text: "и я хз почему, но уже боюсь без тебя" },
            { time: 82.4, text: "она знает почему у меня дырки в штанах" },
            { time: 85.3, text: "она попалась на 'сосала?'", kidsText: "она попалась на '******?'" },
            { time: 87.0, text: "и ответила да!" },
            { time: 88.3, text: "я так люблю тебя, поверь" },
            { time: 89.8, text: "но между нами хуйня", kidsText: "но между нами *****" },
            { time: 91.3, text: "и я хз почему, но уже боюсь без тебя" }
		]
    },
	{
        id: "papa",
        title: "ПАПА",
        artist: "темный принц, tewiq, FORTUNA 812",
        album: "ПАПА",
        releaseDate: "2025",
        addedDate: "2026-03-26",
		textAuthor: "Reloster",
		explicit: true,
        cover: "../7.png",
        src: "../7.mp3",
        lyrics: [
            { time: 0.4, text: "(ну вот смотри артем)" },
            { time: 2.2, text: "(она 10 из 10)" },
            { time: 4.2, text: "(но она маленький темный принц)" },
            { time: 7.0, text: "папа, па-папа" },
            { time: 8.3, text: "заходит в офис, шалавы в шоке", kidsText: "заходит в офис, ****** в шоке" },
            { time: 10.9, text: "пока папа работал - летели логи" },
            { time: 13.7, text: "папе дайте потрогать тити и жопу", kidsText: "папе дайте потрогать т**и и ж**у" },
            { time: 16.8, text: "папа заходит в офис, папа заводит" },
            { time: 19.2, text: "моя цель - её разрушить" },
            { time: 21.7, text: "дропнул её как трек в СК, не буду пушить" },
            { time: 24.6, text: "мне не нужна она" },
            { time: 25.8, text: "знаю она не лучше" },
            { time: 27.4, text: "факаю тебя в маске, что с улыбкою по уши", kidsText: "***** тебя в маске, что с улыбкою по уши" },
            { time: 30.3, text: "с улыбкою по уши, я воркаю один" },
            { time: 33.2, text: "за минуту три лога, да, мои пальцы в крови" },
            { time: 36.2, text: "парень ебанный лох, ведь ты без скита и айди", kidsText: "парень ******* лох, ведь ты без скита и айди" },
            { time: 39.0, text: "мне нужен профит, нужен обход VINTED" },
			{ time: 42.1, text: "папа, па-папа" },
            { time: 43.3, text: "заходит в офис, шалавы в шоке", kidsText: "заходит в офис, ****** в шоке" },
            { time: 45.8, text: "пока папа работал - летели логи" },
            { time: 48.7, text: "папе дайте потрогать тити и жопу", kidsText: "папе дайте потрогать т**и и ж**у" },
            { time: 51.7, text: "папа заходит в офис, папа заводит" },
            { time: 54.6, text: "папа почистил логи, и сделал много" },
            { time: 57.3, text: "папа подделал подписи по дороге" },
            { time: 60.3, text: "папа неаккуратно, или немного" },
			{ time: 63.2, text: "папа, преппараты, и параноит", kidsText: "папа-, и па****ит" },
            { time: 67.1, text: "во мне сейчас бокал вина" },
            { time: 68.6, text: "детка не думала что SWAG идет ей прямо от меня" },
			{ time: 71.4, text: "я просыпаюсь среди ночи ради денег для себя" },
            { time: 74.6, text: "ведь у папы есть семья, я папа 8-1-2" },
			{ time: 77.0, text: "папа, па-папа" },
            { time: 78.2, text: "заходит в офис, шалавы в шоке", kidsText: "заходит в офис, ****** в шоке" },
            { time: 80.6, text: "пока папа работал - летели логи" },
            { time: 83.5, text: "папе дайте потрогать тити и жопу", kidsText: "папе дайте потрогать т**и и ж**у" },
            { time: 86.5, text: "папа заходит в офис, папа заводит" },
            { time: 89.4, text: "(музыка)" }
        ]
    },
	{
		"id": "suchka-soset-dostala",
		"title": "сучка сосет достала",
		"artist": "урал гайсин",
		"album": "сучка сосет достала",
		"releaseDate": "2025",
		"addedDate": "2026-03-27",
		"textAuthor": "Reloster",
		"explicit": true,
		"cover": "../8.png",
		"src": "../8.mp3",
		"lyrics": [
        {
            "time": 2.9,
            "text": "(твоя сука сосет)",
            "kidsText": "(твоя **** *****)"
        },
        {
            "time": 6.9,
            "text": "(твоя сука сосет)",
            "kidsText": "(твоя **** *****)"
        },
        {
            "time": 10.8,
            "text": "(твоя сук сосет)",
            "kidsText": "(твоя *** *****)"
        },
        {
            "time": 12.8,
            "text": "(она мне сосет, а)",
            "kidsText": "(она мне *****, а)"
        },
        {
            "time": 14.7,
            "text": "(она мне сосеет!)",
            "kidsText": "(она мне ******!)"
        },
        {
            "time": 16.2,
            "text": "все эти суки базарят",
            "kidsText": "все эти **** базарят"
        },
        {
            "time": 18.2,
            "text": "но эта сука со мною, ой",
            "kidsText": "но эта сука со мною, ой"
        },
        {
            "time": 20.1,
            "text": "поделись своей любовью"
        },
        {
            "time": 22.3,
            "text": "между твоей губою, уу!"
        },
        {
            "time": 24.2,
            "text": "она говорит отстань"
        },
        {
            "time": 26.2,
            "text": "перехожу эту грань!"
        },
        {
            "time": 28.1,
            "text": "я говорю ей 'сосать!'",
            "kidsText": "я говорю ей '******!'"
        },
        {
            "time": 30,
            "text": "она летит на кровать"
        },
        {
            "time": 31.6,
            "text": "дохуя курю этот кальян",
            "kidsText": "***** к**ю этот ка***н"
        },
        {
            "time": 34,
            "text": "она готова дать мне я пьян",
            "kidsText": "она готова д**ь мне я п**н"
        }
    ]
	},
{
    "id": "nam-kanec",
    "title": "нам канец!",
    "artist": "плм",
    "album": "нам канец!",
    "releaseDate": "2022",
    "addedDate": "2026-03-28",
    "textAuthor": "Reloster",
    "explicit": true,
    "cover": "../9.png",
    "src": "../9.mp3",
    "lyrics": [
        {
            "time": 0.5,
            "text": "Удивительно, но план по развалу России"
        },
        {
            "time": 3,
            "text": "В США появился еще в начале 60-х годов"
        },
        {
            "time": 6.6,
            "text": "(музыка)"
        },
        {
            "time": 21.4,
            "text": "По телевизору сказали"
        },
        {
            "time": 23.4,
            "text": "Скоро нам придет пизда",
            "kidsText": "Скоро нам придет *****"
        },
        {
            "time": 25.2,
            "text": "Что евреи украдут"
        },
        {
            "time": 26.9,
            "text": "Все наши деньги с кошелька"
        },
        {
            "time": 29,
            "text": "Американцы скоро уничтожат наши KFC"
        },
        {
            "time": 32.7,
            "text": "Они все в жопы ебутся",
            "kidsText": "Они все в ж**ы ******"
        },
        {
            "time": 34.6,
            "text": "Скалят зубы на Россию"
        },
        {
            "time": 36.4,
            "text": "И там хохлы готовят план",
            "kidsText": "И там ***** готовят план"
        },
        {
            "time": 38.2,
            "text": "По мутации детей"
        },
        {
            "time": 40.1,
            "text": "Скоро к нам придут татары"
        },
        {
            "time": 42,
            "text": "Трахнут наших матерей",
            "kidsText": "******* наших матерей"
        },
        {
            "time": 43.7,
            "text": "К нам сюда летит Джо Байден"
        },
        {
            "time": 45.7,
            "text": "И он всех нас обоссыт",
            "kidsText": "И он всех нас об****ыт"
        },
        {
            "time": 47.5,
            "text": "Мы великая Россия"
        },
        {
            "time": 49.4,
            "text": "Выпускаем крепостных"
        },
        {
            "time": 51.8,
            "text": "После школы мы пойдем швырятся кислотой",
            "kidsText": "После школы мы пойдем ш******* к******й"
        },
        {
            "time": 55.1,
            "text": "Ведь вся наша жизнь это ебанный отстой",
            "kidsText": "Ведь вся наша жизнь это ******* отстой"
        },
        {
            "time": 59.1,
            "text": "Я тебя не призываю делать как мы"
        },
        {
            "time": 62.4,
            "text": "Просто нам уже никем не стать, мы обречены!"
        },
        {
            "time": 66.4,
            "text": "Если бы я был пилотом"
        },
        {
            "time": 68.7,
            "text": "Я б упал на дно"
        },
        {
            "time": 70.2,
            "text": "Да и если бы я не был"
        },
        {
            "time": 72,
            "text": "Я упал бы все равно"
        },
        {
            "time": 74.2,
            "text": "Сам себя подставил, больше не нужны предатели"
        },
        {
            "time": 78.1,
            "text": "Дети пишут 'где вторая половина матери??'"
        },
        {
            "time": 81.7,
            "text": "Нам пиздец, и мы все умрем!",
            "kidsText": "Нам ******, и мы все у***м"
        },
        {
            "time": 85.1,
            "text": "Нам пиздец, и мы все умрем!",
            "kidsText": "Нам ******, и мы все у***м"
        },
        {
            "time": 89.2,
            "text": "Нам пиздец, и мы все умрем!",
            "kidsText": "Нам ******, и мы все у***м"
        },
        {
            "time": 93,
            "text": "Нам пиздец, и мы все умрем!",
            "kidsText": "Нам ******, и мы все у***м"
        },
        {
            "time": 98,
            "text": "Ускоглазые японцы забывают про тоску"
        },
        {
            "time": 101.7,
            "text": "И хентаем завоюют наши Питер и Москву",
            "kidsText": "И ******* завоюют наши Питер и Москву"
        },
        {
            "time": 105.4,
            "text": "Колдуны, ведьмы, китайцы призывают сатану"
        },
        {
            "time": 109.1,
            "text": "И теперь Россия это жесткое порево в аду"
        },
        {
            "time": 114.4,
            "text": "Нас не сломать ничеем"
        },
        {
            "time": 116.5,
            "text": "У нас мильон проблеем"
        },
        {
            "time": 118.2,
            "text": "Но нам не страшно совсеем!"
        },
        {
            "time": 122,
            "text": "Мы величайшие люди"
        },
        {
            "time": 123.8,
            "text": "Месяц не рукоблудим"
        },
        {
            "time": 125.7,
            "text": "С нами Марголдин и путин (а!)"
        },
        {
            "time": 128.2,
            "text": "Если бы я был пилотом"
        },
        {
            "time": 130.1,
            "text": "Я бы упал на дно"
        },
        {
            "time": 131.5,
            "text": "Да и если бы я не был"
        },
        {
            "time": 133.4,
            "text": "Я упал бы все равно"
        },
        {
            "time": 135.6,
            "text": "Сам себя подставил, больше не нужны предатели"
        },
        {
            "time": 139.4,
            "text": "Дети пишут 'где вторая половина матери??'"
        },
        {
            "time": 143.1,
            "text": "Нам пиздец, и мы все умрем!",
            "kidsText": "Нам ******, и мы все у***м!"
        },
        {
            "time": 146.7,
            "text": "Нам пиздец, и мы все умрем!",
            "kidsText": "Нам ******, и мы все у***м!"
        },
        {
            "time": 150.6,
            "text": "Нам пиздец, и мы все умрем!",
            "kidsText": "Нам ******, и мы все у***м!"
        },
        {
            "time": 154.3,
            "text": "Нам пиздец, и мы все умрем!",
            "kidsText": "Нам ******, и мы все у***м!"
        },
        {
            "time": 158,
            "text": "(конечная музыка)"
        }
    ]
}
];